Revit 2027 API
RebarBendingDetailType.SegmentLengthDimensionsEnabled Property
 Identifies if any segment length dimensions will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SegmentLengthDimensionsEnabled { get; set; }
Public Property SegmentLengthDimensionsEnabled As Boolean
	Get
	Set
public:
property bool SegmentLengthDimensionsEnabled {
	bool get ();
	void set (bool value);
}
member SegmentLengthDimensionsEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace